export const ru = {
  navbar1: "Главная",
  navbar2: "Услуги",
  navbar3: "О нас",
  navbar4: "Команда",
  navbar5: "Контакты",
  navbar6: "Отзывы",

  header1: "Ремонт холодильников в Ташкенте",
  header2: "Заказать звонок",

  services1: "Наши услуги",
  services2: "Работаем со всеми видами техники",
  services3: "Ремонт бытовой техники",
  services4: "Ремонт стиральных машин",
  services5: "Ремонт морозильных камер",
  services6: "Ремонт холодильных витрин",
  services7: "Ремонт мотора",
  services8: "Гарантия от 6 месяцев до 4 лет",
  services9: "Заказать услугу",

  q1: "Не нашли свой вид техники? Тогда, звоните или оставляйте заявку и оператор проконсультирует вас по всем услугам нашей компании!",
  q2: "Задать вопрос",

  road1: "Наш путь",
  road2:
    "Мы фирму открыли в 2013 году. На главе фирмы я, Бондарев Владимир. В сфере ремонта сложно бытовой техники работаю с 2000 года. Занимаюсь в основном ремонтом холодильников, морозильников витрин. За это время мы оказали свои услуги более 1000 клиентам и завоевали свое место среди людей. И мы по-прежнему оказываем наилучшую помощь людям, облегчая их проблемы.",

  team1: "Все специалисты компании",

  b1: "Мы отличаемся тремя преимуществами",
  b2: "Гарантия качество",
  b3: "Мы обязательно даём гарантию на выполненную нами работу. Потому что все наши специалисты мастера своего дела и дают гарантию на свою работу.",
  b4: "Ремонт за 1 час",
  b5: "В зависимости от типа оборудования и ремонтных работ гарантируем ремонт в течение 1 часа!",
  b6: "Гарантия качество",
  b7: "Мы обязательно даём гарантию на выполненную нами работу. Потому что все наши специалисты мастера своего дела и дают гарантию на свою работу.",

  r1: "Рейтинг",
  r2: "На основании 11 отзыва и 11 оценок",
  r3: "Отзывы клиентов",
};
