export const ru = {
  nav_1: `Главная`,
  nav_2: `Все направлении`,
  nav_3: `О нас`,
  nav_4: `Контакты`,
  nav_5: `Регистрация`,
  nav_6: `Войти`,
  nav_7: `Помощь в визе`,

  header_box_1: `путешествуйте мир`,
  header_box_2: `Давайте путешествовать по`,
  header_box_3: `миру`,
  header_box_4: `Ознакомьтесь с`,
  header_box_5: `"Time Tour"`,
  header_box_6: `вместе со своим партнером по путешествиям! Сделайте свой отпуск веселым, захватывающим и незабываемым.`,
  header_box_7: `Забронировать сейчас`,

  headpro_name: `Выгодные предложения`,
  headpro_name_2: ` Популярные месты`,

  h_about_h: `О нас`,
  h_about_sub: ` С Time Tour каждый уголок планеты стал гораздо ближе и доступнее.`,
  h_about_p_1: `Весь мир на ладони. С Time Tour каждый уголок планеты стал гораздо ближе и доступнее. Путешествия открывают нам заново мир каждый раз, как только мы посещаем другую страну. Всё удивительное рядом, достаточно только решиться и сделать первый шаг.`,
  h_about_p_2: `Наш новый дизайн отражает иной взгляд, совершенно новый подход к вашему отдыху. Это прекрасная возможность пополнить свой багаж новыми знаниями, изучив культуру и традиции других народов. С нами вы сможете посетить уникальные места нашей планеты, познакомиться с интересными людьми и узнать вкус настоящего турецкого кофе, цейлонского чая, высоту египетских пирамид.`,

  head_info_name: `Что у нас особенного`,
  h_info_text_h_1: `Time Tour`,
  h_info_text_p_1: `Мы четко понимаем ситуацию в мире, ввиду пандемии, поэтому все наши предложения о путешествиях основаны на безопасности и стабильности.`,
  h_info_text_h_2: `Индивидуальный подход`,
  h_info_text_p_2: `Мы организовываем туристические поездки, как и для индивидуальных туристов, так и для больших корпоративных групп с целью деловых или развлекательных событий.`,
  h_info_text_h_3: `На связи 24/7`,
  h_info_text_p_3: `Мы заключаем договоры сотрудничества только с проверенными и надежными туроператорами, которые остаются на связи с нашими гостями 24/7.`,
  h_info_text_h_4: `Лучшие цены`,
  h_info_text_p_4: `Мы постоянно отслеживаем актуальность цен и уникальность предложений. Мы сформировали большую базу лучших отелей по всему миру в зависимости от бюджетов наших клиентов`,

  h_contact_name: `Связаться с нами`,
  c_head_name_1: `Телефон номер`,
  c_head_name_2: `Время работы`,
  c_head_name_3: `Понедельник - суббота с 9:00 до 18: 00`,
  c_head_name_4: `Адрес`,
  c_head_name_5: `Sebzar Street, Tashkent, Yunusabad, Tashkent, Uzbekistan`,
  c_head_name_6: "Управляющий",
  c_head_name_7: "Салихов Ровшан Батирович",

  footer_box_name: `ИНФОРМАЦИЯ`,
  tour: `ТУРЫ`,
  headpro_name_3: `Все направлении`,

  registr_name_1: `Регистрация`,
  registr_name_2: `Войти`,

  registr_h_1: `Ваш номер телефона *`,
  registr_h_2: `Установите пароль *`,
  registr_h_3: `Подтвердите пароль  *`,
  registr_h_4: ` Пароль *`,
  registr_h_5: ` Забыли пароль?`,

  cab_name: `Выберите дату`,
  cal_pay_h: `Оплатить`,

  pay_name: ` Выберите тип оплаты`,

  from: `от`,

  detail_order_btn: `Забронировать сейчас`,
  town_name: `с вылетом из`,
  town_h: `Даты туров:`,
  town_h2: ` *цена может меняться в соответствии с курсом ЦБ"`,

  login_false: `Введите информацию правильно`,
  log_out: `Выйти`,
  sum: `сум`,

  card_1: `Провести платеж`,
  card_2: `Сумма платежа`,
  card_3: `Введите номер карты`,
  card_4: `Срок действия`,
  card_5: `Подтвердить`,
  card_6: `Введите код подтверждения`,
  card_7: `Ваш платеж успешно произведен`,

  visa_a_1: `Получить консультацию`,
  visa_box_name: `ПОЧЕМУ НАС ВЫБИРАЮТ?`,
  visa_box_name_1: `Доступное приобретение визы`,
  visa_box_name_2: `Поможем с приобретением визы в другую страну с максимальной эффективностью.`,
  visa_box_name_3: `Виза в большинство стран`,
  visa_box_name_4: `Профессиональная визовая поддержка в выбранную Вами страну.`,
  visa_box_name_5: `Выгодные предложения`,
  visa_box_name_6: `Подберем для Вас самые выгодные предложения по визам и визовой поддержке`,

  visa_p_1: `Визовая поддержка`,
  visa_p_2: `Визовая поддержка – услуга по подготовке визовых документов и консультации по всем вопросам, связанным с оформлением, получением необходимых документов для открытия виз.
 `,
  visa_p_3: ` Визовая поддержка чаще всего оказывается иностранному гражданину консульством той страны, куда он планирует или хочет приехать, за рубежом, Турция, Египет и другие страны. Оформление визы в таких случаях на основании официального приглашения, оформленного в установленном законодательством той страны, которую иностранец планирует посетить. Приглашение может быть оформлено, как по приглашению физического лица, так и юридического, агентства или центра, оказывающего Визовую поддержку.`,
};
