const BrightFuture = () => {
  return (
    <div className="BrightFuture BrightWrap">
      <div className="container">
        <div className="row">
          <div className="col-lg-11 mx-auto">
            <h1>
              Ўзбекистоннинг порлоқ келажаги учун биз ўзимизнинг қандай
              ҳиссамизни қўшмоқчимиз?
            </h1>
            <p>
              — Ўзбек аёлининг оиладаги мавқейини ошириш учун унинг оиласидаги
              психологик муҳитни яхшилаш, <br /> <br />
              — Аёлларни қурбон позициясидан чиқишига ҳамда янги ҳаёт
              бошлашларига кўмаклашиш, <br />
              — Турли-ҳил жисмоний кассаликларнинг психосоматикасини топишга
              ҳамда руҳий исканжаларнинг баридан қутилишларига ёрдамлашиш,
              <br /> <br />— Ва энг асосийси - аёл кишини пул топишга ўргатиш ва
              даромадини ошириш. Биз қилаётган ишимиздан фахрланамиз!
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default BrightFuture;
