import React from "react";

const Plans = () => {
  return (
    <div className="Plans BrightWrap">
      <div className="container">
        <div className="row">
          <div className="col-12">
            <h1>Бизнинг келажакдаги режаларимиз:</h1>
            <p>
              Лойиҳа Ўзбекистон хотин-қизларини қўллаб-қувватлашга ҳамда
              уларнинг ҳаёт тарзини ривожлантириш бўйича фаолият олиб бораётган
              давлат идоралари ва хусусий компаниялар, шунингдек, ННТ ҳамда НТТ
              билан ҳамкорликни режалаштирган <br /> <br /> Бизнинг ғоямиз:{" "}
              <br /> Ўзбекистон Республикасида хотин-қизларнинг руҳий
              саломатлигини яхшилаш ва психологик ёрдам кўрсатиш орқали аёллар
              қатламининг ақлий ва жисмоний салоҳиятини ривожлантириш.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Plans;
