export const ru = {
    catalog: "Каталог",
    individual: "Индивидуальный пошив",
    matolar: "Ткани",
    about: "О нас",
    vakansiya: "Вакансии",
    contacts: "Контакты",
    features: "Наши преимущества",
    featuresT: "Добро пожаловать в наш сервис свадебных платьев",
    feat1: "Способы оплаты",
    feat1D:
      "Выберите наиболее удобный для вас способ оплаты: наличными, картой, переводом.",
    feat2: "Почему именно мы?",
    feat2D:
      "Мы предоставим вам платье, которое будет сшито по вашим меркам и будет идеально подходить по вашей фигуре",
    feat3: "Гарантия",
    feat3D:
      "Мы гарантируем, что предоставим вам уникальный и симпатичный наряд, который заслужит ваше доверие.",
  
    gallery: "Галерея",
    statistika: "Статистика",
    inNumbers: "Мы в цифрах",
    employees: "Сотрудники",
    clients: "Довольные клиенты",
    typesofclothes: "Типы платьев",
  
    aboutTeam: "О команде Bella Vita",
  
    aboutTeamDesc:
      "Свадебный дом «Bella Vita Wedding» также предоставляет услугу индивидуального пошива свадебного платья. Мы предлагаем невестам все возможности для индивидуального пошива. Работа над каждой новой модели начинается с выбора тканей и фасона.  Клиенты могут выбрать ткань, силуэт, декор и даже фурнитуру. Это очень увлекательный процесс!",
  
    indiv1:
      "Пошив свадебного платья может занять от 10 дней и до месяца, что важно учитывать при планировании свадьбы. За это время дизайнеры тратят достаточно времени на поиск и выбор идеально соответствующих желаниям материалов, создание индивидуальных лекал, проработку дизайна и его утверждение",
    indiv2: "В чем преимущества услуги?",
    indiv3:
      "1. Мы предоставим вам платье, которое будет сшито по вашим меркам и будет идеально подходить по вашей фигуре.",
    indiv4:
      "2. У клиента будет возможность скорректировать образ и детали, выбрать материал и фасон. А для воплощения идей используются лучшие материалы такие как: французское кружево, индийские аппликации ручной работы, хлопок, шелк.",
    indiv5:
      "3. В процессе всегда можно будет что-то подправить и скорректировать (например, добавить или убрать какую-то деталь), чего нельзя сделать с уже готовым платьем. ",
    indiv6: `4. Выбрав Услугу «индивидуального пошива» невестам будут уделены отдельное внимание. У невесты появится возможность создать самое красивое, стильное и уникальное платье, которое будет идеально сидеть на ее фигуре и выглядеть в точности ее ожиданиям и мечтам.`,
    indiv7:
      "5. Учитывая Ваши параметры и пожелания, наши дизайнеры, модельеры-конструкторы относятся к каждому заказу с новым взглядом и ответственностью. Каждая деталь будет тщательно продумана невестой вместе с дизайнером. Ведь для нас индивидуальность эстетика и гармония в образах превыше всего.",
  
    contactUs: "Свяжитесь с нами",
    adres: "Адрес",
    address: "г. Ташкент, Учтепинский р-н, ул. Курилиш 44а",
  
    individualT: "ИНДИВИДУАЛЬНЫЙ ПОДХОД К КАЖДОМУ КЛИЕНТУ",
    individualDes: "Хотите заказать свадебное платье?",
    individualD: "Пошив свадебных платьев",
  
    name: "Ф.И.О",
    tel: "Номер телефона",
    send: "Отправить",
    slogan: "Наши свадебные платья будут служить в вашем особенном дне.",
    map: "Карта сайта",
  
    aboutD:
      "«Bella Vita Wedding» - это компания которая имеет 20 летний опыт на рынке свадебной моды, это лидирующий и крупнейший производитель свадебных платьев в Узбекистане.",
  
    about1:
      " •Это организация, где вы сможете приобрести свадебные платья для себя лично для вашего мероприятия а также купить платья оптом для своего свадебного салона.",
  
    about2:
      "•Это также индивидуальный пошив, который будет изготавливаться лично по вашим меркам, и будет показывать вашу индивидуальность и подчеркивать красоту.",
  
    about3:
      "Мы постоянно меняем модельный ряд свадебных образов, создавая неповторимые и новые сезонные коллекции сочетая в них современные свадебные ткани и украшения. Широкий ассортимент позволяет удовлетворить вкус и каприз каждого клиента. ",
  
    about4:
      "Наша цель — это не завоевать ваше сердце мировыми именами кутюрье, а предоставить неповторимый и восхитительный наряд которое завоюет ваше доверие к нам. Каждая невеста воображает у себя в голове свое платье мечты и каждая из них имеет свой индивидуальный вкус свадебного наряда. А мы только осуществляем мечты невест в реальность.",
  
    dream: "Закажите платье своей мечты",
    contactMe: "Свяжитесь с нами",
    toContactUs: "Оставьте заявку, чтобы связаться с нами!",
    libosuchunmato: "Ткани для платьев",
  
    falsafa:
      "Свою философию мы продолжаем в аккаунтах Instagram, на наших каналах Telegram и Youtube.",
  
    all: "Все",
    typeOfDress: "Тип платья:",
    sizeOfDress: "Размер:",
    price: "Цена:",
    product_code: "Код продукта:",
  
    empty: "Ничего не добавлено",
  
    urJob: "Найдите подходящую работу",
  
    salary: "Зарплата:",
    grafik: "График работы:",
    typeofJob: "Тип работы:",
  
    joinTeam: "Хотите присоединиться к нашей команде?",
    success: "Успешно отправлено!",
    error: "Произошла ошибка!",
  search: "Поиск",

}